# =============================================================================
# Brewfile - Homebrew Bundle
# Install with: brew bundle --file=~/dotfiles/Brewfile
# =============================================================================

# Taps
tap "homebrew/bundle"

# -----------------------------------------------------------------------------
# Core CLI Tools
# -----------------------------------------------------------------------------
brew "mise"           # Version manager (node, go, python, etc.)
brew "starship"       # Prompt
brew "gh"             # GitHub CLI
brew "git"            # Version control (brew version is newer)

# Shell
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"

# Search & Navigation
brew "ripgrep"        # Better grep (rg)
brew "fd"             # Better find
brew "fzf"            # Fuzzy finder
brew "lazygit"        # Git TUI

# Modern CLI replacements
brew "eza"            # Better ls with icons & git
brew "bat"            # Better cat with syntax highlighting
brew "zoxide"         # Smarter cd (z command)
brew "tlrc"           # Simplified man pages (tldr)

# Shell enhancements
brew "atuin"          # Better shell history with sync
brew "direnv"         # Auto-load .envrc files
brew "tmux"           # Terminal multiplexer

# Utilities
brew "jq"             # JSON processor
brew "difftastic"     # Syntax-aware diffs
brew "btop"           # System monitor
brew "httpie"         # HTTP client

# -----------------------------------------------------------------------------
# Development Tools
# -----------------------------------------------------------------------------
brew "awscli"         # AWS CLI
brew "eksctl"         # EKS CLI
brew "helm"           # Kubernetes package manager
brew "k9s"            # Kubernetes TUI
brew "docker-compose" # Docker Compose
brew "pnpm"           # Fast npm alternative

# Cloud & Infrastructure
brew "cloudflared"    # Cloudflare tunnel
brew "pulumi"         # Infrastructure as code
brew "coder"          # Remote development

# AI Tools
brew "aichat"         # AI chat CLI

# Media
brew "ffmpeg"         # Video/audio processing

# -----------------------------------------------------------------------------
# GUI Applications (Casks)
# -----------------------------------------------------------------------------
cask "1password"
cask "1password-cli"
cask "arc"
cask "claude-code"
cask "discord"
cask "docker"
cask "ghostty"
cask "linear-linear"
cask "notion"
cask "raycast"
cask "rectangle"
cask "slack"
cask "syncthing"
cask "tailscale"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Google Cloud (uncomment if needed)
# cask "google-cloud-sdk"
